# Устанавливаем официальный образ Node.js
FROM node:20-alpine

# Указываем рабочую (корневую) директорию
WORKDIR /app

# Копируем основные файлы приложения в рабочую директорию
COPY package.json package-lock.json ./

# Устанавливаем указанные зависимости NPM на этапе установки образа
RUN npm install

# После установки копируем все файлы проекта в корневую директорию
COPY . .

# Открываем порт 5173 (стандартный порт Vite)
EXPOSE 5173

# Запускаем основной скрипт в момент запуска контейнера
CMD ["npm", "run", "dev"]
